src/Documents/СостояниеПортфеля/СостояниеПортфеля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СостояниеПортфеля</name>
  <basedOn>Catalog.Портфели</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНКД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Тикеры</name>
    <attributes>
      <name>Тикер</name>
      <type>
        <types>CatalogRef.Облигации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПокупки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПокупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номинал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НКД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНКД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКупона</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СостояниеПортфеля/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Тогда 
		Возврат;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Портфели") Тогда
     	Портфель = ДанныеЗаполнения;
		Для Каждого спрТикер Из ДанныеЗаполнения.Тикеры Цикл
			Если спрТикер.Закрыт Тогда
				Продолжить;				
			КонецЕсли;
			Тикер = Тикеры.Добавить();
			ЗаполнитьЗначенияСвойств(Тикер, спрТикер);
			//@skip-check undefined-variable
			Тикер.Номинал = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(спрТикер.Тикер, "FACEVALUE"); 
			
			//@skip-check undefined-function
			ЗаполнитьЗначенияСвойств(Тикер, ТекущаяЦена_НКД(Тикер.Тикер.SECID, Тикер.Тикер.BOARDID));
			Тикер.СуммаНКД = Тикер.НКД * Тикер.Количество;
			Тикер.Сумма = (Тикер.Цена*Тикер.Номинал/100 + Тикер.НКД) * Тикер.Количество;
		КонецЦикла;
		Сумма = Тикеры.Итог("Сумма");
		СуммаНКД = Тикеры.Итог("СуммаНКД");
     КонецЕсли;                               
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ТекущаяЦена_НКД(SECID, BOARDID)
	URL = СтрШаблон(
			"https://iss.moex.com/iss/engines/stock/markets/bonds/boards/%1/securities.json?securities=%2&iss.meta=off&iss.only=securities,marketdata&iss.json=extended",
			BOARDID,
			SECID
		);

	ДопПараметры = КлиентHTTPКлиентСервер.НовыеДополнительныеПараметры();
	//@skip-check bsl-legacy-check-returning-type-for-environment
	Ответ = КлиентHTTPКлиентСервер.ТелоОтветаКакJSON(ДопПараметры).Получить(URL, , ДопПараметры);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						        	НСтр("ru='Ошибка получения данных с биржи. Код ответа <%1>'"),
						        	Ответ.КодСостояния);
		#Если Сервер Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстПредупреждения);		
		#КонецЕсли
		Возврат Неопределено;		
	КонецЕсли;
	
	Marketdata = Ответ.Тело[1].marketdata[0];
	Securities = Ответ.Тело[1].securities[0];
	
	Попытка
		Цена = Число(Marketdata.last);	
	Исключение
		Цена = Число(Securities.prevlegalcloseprice);	
	КонецПопытки;
	
	НКД = Число(Securities.accruedint);
	Номинал = Securities.facevalue;
	ДатаКупона = ПрочитатьДатуJSON(Securities.NEXTCOUPON, ФорматДатыJSON.ISO); 
	
	//@skip-check structure-consructor-too-many-keys
	Возврат Новый Структура("Цена, НКД, Номинал, ДатаКупона", Цена, НКД, Номинал, ДатаКупона);
КонецФункции
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
#КонецОбласти
